{
  "resourceType" : "ValueSet",
  "id" : "CDAActClassObservation",
  "text" : {
    "status" : "extensions",
    "div" : "<div xmlns=\"http://www.w3.org/1999/xhtml\"><p class=\"res-header-id\"><b>Generated Narrative: ValueSet CDAActClassObservation</b></p><a name=\"CDAActClassObservation\"> </a><a name=\"hcCDAActClassObservation\"> </a><ul><li>Include these codes as defined in <a href=\"http://terminology.hl7.org/5.3.0/CodeSystem-v3-ActClass.html\"><code>http://terminology.hl7.org/CodeSystem/v3-ActClass</code></a><span title=\"Version is not explicitly stated, which means it is fixed to 3.1.1, the version found through the package references\"> version &#x1F4E6;3.1.1</span><table class=\"none\"><tr><td style=\"white-space:nowrap\"><b>Code</b></td><td><b>Display</b></td><td><b>Definition</b></td></tr><tr><td><a href=\"http://terminology.hl7.org/5.3.0/CodeSystem-v3-ActClass.html#v3-ActClass-CASE\">CASE</a></td><td style=\"color: #cccccc\">public health case</td><td>A public health case is an Observation representing a condition or event that has a specific significance for public health. Typically it involves an instance or instances of a reportable infectious disease or other condition. The public health case can include a health-related event concerning a single individual or it may refer to multiple health-related events that are occurrences of the same disease or condition of interest to public health. An outbreak involving multiple individuals may be considered as a type of public health case. A public health case definition (Act.moodCode = &quot;definition&quot;) includes the description of the clinical, laboratory, and epidemiologic indicators associated with a disease or condition of interest to public health. There are case definitions for conditions that are reportable, as well as for those that are not. There are also case definitions for outbreaks. A public health case definition is a construct used by public health for the purpose of counting cases, and should not be used as clinical indications for treatment. Examples include AIDS, toxic-shock syndrome, and salmonellosis and their associated indicators that are used to define a case.</td></tr><tr><td><a href=\"http://terminology.hl7.org/5.3.0/CodeSystem-v3-ActClass.html#v3-ActClass-OUTB\">OUTB</a></td><td style=\"color: #cccccc\">outbreak</td><td>An outbreak represents a series of public health cases. The date on which an outbreak starts is the earliest date of onset among the cases assigned to the outbreak, and its ending date is the last date of onset among the cases assigned to the outbreak.</td></tr><tr><td><a href=\"http://terminology.hl7.org/5.3.0/CodeSystem-v3-ActClass.html#v3-ActClass-COND\">COND</a></td><td style=\"color: #cccccc\">Condition</td><td>An observable finding or state that persists over time and tends to require intervention or management, and, therefore, distinguished from an Observation made at a point in time; may exist before an Observation of the Condition is made or after interventions to manage the Condition are undertaken. Examples: equipment repair status, device recall status, a health risk, a financial risk, public health risk, pregnancy, health maintenance, chronic illness</td></tr><tr><td><a href=\"http://terminology.hl7.org/5.3.0/CodeSystem-v3-ActClass.html#v3-ActClass-OBSSER\">OBSSER</a></td><td style=\"color: #cccccc\">observation series</td><td>Container for Correlated Observation Sequences sharing a common frame of reference. All Observations of the same cd must be comparable and relative to the common frame of reference. For example, a 3-channel ECG device records a 12-lead ECG in 4 steps (3 leads at a time). Each of the separate 3-channel recordings would be in their own &quot;OBSCOR&quot;. And, all 4 OBSCOR would be contained in one OBSSER because all the times are relative to the same origin (beginning of the recording) and all the ECG signals were from a fixed set of electrodes.</td></tr><tr><td><a href=\"http://terminology.hl7.org/5.3.0/CodeSystem-v3-ActClass.html#v3-ActClass-OBSCOR\">OBSCOR</a></td><td style=\"color: #cccccc\">correlated observation sequences</td><td>Container for Observation Sequences (Observations whose values are contained in LIST&lt;&gt;'s) having values correlated with each other. Each contained Observation Sequence LIST&lt;&gt; must be the same length. Values in the LIST&lt;&gt;'s are correlated based on index. E.g. the values in position 2 in all the LIST&lt;&gt;'s are correlated. This is analogous to a table where each column is an Observation Sequence with a LIST&lt;&gt; of values, and each row in the table is a correlation between the columns. For example, a 12-lead ECG would contain 13 sequences: one sequence for time, and a sequence for each of the 12 leads.</td></tr><tr><td><a href=\"http://terminology.hl7.org/5.3.0/CodeSystem-v3-ActClass.html#v3-ActClass-ROIBND\">ROIBND</a></td><td style=\"color: #cccccc\">bounded ROI</td><td>A Region of Interest (ROI) specified for a multidimensional observation, such as an Observation Series (OBSSER). The ROI is specified using a set of observation criteria, each delineating the boundary of the region in one of the dimensions in the multidimensional observation. The relationship between a ROI and its referenced Act is specified through an ActRelationship of type subject (SUBJ), which must always be present. Each of the boundary criteria observations is connected with the ROI using ActRelationships of type &quot;has component&quot; (COMP). In each boundary criterion, the Act.code names the dimension and the Observation.value specifies the range of values inside the region. Typically the bounded dimension is continuous, and so the Observation.value will be an interval (IVL) data type. The Observation.value need not be specified if the respective dimension is only named but not constrained. For example, an ROI for the QT interval of a certain beat in ECG Lead II would contain 2 boundary criteria, one naming the interval in time (constrained), and the other naming the interval in ECG Lead II (only named, but not constrained).</td></tr><tr><td><a href=\"http://terminology.hl7.org/5.3.0/CodeSystem-v3-ActClass.html#v3-ActClass-ROIOVL\">ROIOVL</a></td><td style=\"color: #cccccc\">overlay ROI</td><td>A Region of Interest (ROI) specified for an image using an overlay shape. Typically used to make reference to specific regions in images, e.g., to specify the location of a radiologic finding in an image or to specify the site of a physical finding by &quot;circling&quot; a region in a schematic picture of a human body. The units of the coordinate values are in pixels. The origin is in the upper left hand corner, with positive X values going to the right and positive Y values going down. The relationship between a ROI and its referenced Act is specified through an ActRelationship of type &quot;subject&quot; (SUBJ), which must always be present.</td></tr><tr><td><a href=\"http://terminology.hl7.org/5.3.0/CodeSystem-v3-ActClass.html#v3-ActClass-OBS\">OBS</a></td><td style=\"color: #cccccc\">observation</td><td>**Description:**An act that is intended to result in new information about a subject. The main difference between Observations and other Acts is that Observations have a value attribute. The **code** attribute of Observation and the **value** attribute of Observation must be considered in combination to determine the semantics of the observation.<br/><br/>**Discussion:**<br/><br/>Structurally, many observations are name-value-pairs, where the Observation.code (inherited from Act) is the name and the Observation.value is the value of the property. Such a construct is also known as a variable (a named feature that can assume a value) hence, the Observation class is always used to hold generic name-value-pairs or variables, even though the variable valuation may not be the result of an elaborate observation method. It may be a simple answer to a question or it may be an assertion or setting of a parameter.<br/><br/>As with all Act statements, Observation statements describe what was done, and in the case of Observations, this includes a description of what was actually observed (results or answers); and those results or answers are part of the observation and not split off into other objects.<br/><br/>The method of action is asserted by the Observation classCode or its subclasses at the least granular level, by the Observation.code attribute value at the medium level of granularity, and by the attribute value of observation.methodCode when a finer level of granularity is required. The method in whole or in part may also appear in the attribute value of Observation.value when using coded data types to express the value of the attribute. Relevant aspects of methodology may also be restated in value when the results themselves imply or state a methodology.<br/><br/>An observation may consist of component observations each having their own Observation.code and Observation.value. In this case, the composite observation may not have an Observation.value for itself. For instance, a white blood cell count consists of the sub-observations for the counts of the various granulocytes, lymphocytes and other normal or abnormal blood cells (e.g., blasts). The overall white blood cell count Observation itself may therefore not have a value by itself (even though it could have one, e.g., the sum total of white blood cells). Thus, as long as an Act is essentially an Act of recognizing and noting information about a subject, it is an Observation, regardless of whether it has a simple value by itself or whether it has sub-observations.<br/><br/>Even though observations are professional acts (see Act) and as such are intentional actions, this does not require that every possible outcome of an observation be pondered in advance of it being actually made. For instance, differential white blood cell counts (WBC) rarely show blasts, but if they do, this is part of the WBC observation even though blasts might not be predefined in the structure of a normal WBC.<br/><br/>Clinical documents commonly have Subjective and Objective findings, both of which are kinds of Observations. In addition, clinical documents commonly contain Assessments, which are also kinds of Observations. Thus, the establishment of a diagnosis is an Observation.<br/><br/>**Examples:**<br/><br/> *  Recording the results of a Family History Assessment<br/> *  Laboratory test and associated result<br/> *  Physical exam test and associated result<br/> *  Device temperature<br/> *  Soil lead level</td></tr><tr><td><a href=\"http://terminology.hl7.org/5.3.0/CodeSystem-v3-ActClass.html#v3-ActClass-ALRT\">ALRT</a></td><td style=\"color: #cccccc\">detected issue</td><td>An observation identifying a potential adverse outcome as a result of an Act or combination of Acts.<br/><br/>*Examples:* Detection of a drug-drug interaction; Identification of a late-submission for an invoice; Requesting discharge for a patient who does not meet hospital-defined discharge criteria.<br/><br/>*Discussion:* This class is commonly used for identifying 'business rule' or 'process' problems that may result in a refusal to carry out a particular request. In some circumstances it may be possible to 'bypass' a problem by modifying the request to acknowledge the issue and/or by providing some form of mitigation.<br/><br/>*Constraints:* the Act or Acts that may cause the the adverse outcome are the target of a subject ActRelationship. The subbtypes of this concept indicate the type of problem being detected (e.g. drug-drug interaction) while the Observation.value is used to repesent a specific problem code (e.g. specific drug-drug interaction id).</td></tr><tr><td><a href=\"http://terminology.hl7.org/5.3.0/CodeSystem-v3-ActClass.html#v3-ActClass-CLNTRL\">CLNTRL</a></td><td style=\"color: #cccccc\">clinical trial</td><td>The set of actions that define an experiment to assess the effectiveness and/or safety of a biopharmaceutical product (food, drug, device, etc.). In definition mood, this set of actions is often embodied in a clinical trial protocol; in event mood, this designates the aggregate act of applying the actions to one or more subjects.</td></tr><tr><td><a href=\"http://terminology.hl7.org/5.3.0/CodeSystem-v3-ActClass.html#v3-ActClass-CNOD\">CNOD</a></td><td style=\"color: #cccccc\">Condition Node</td><td>An instance of Observation of a Condition at a point in time that includes any Observations or Procedures associated with that Condition as well as links to previous instances of Condition Node for the same Condition<br/><br/>***Deprecation Comment:*** This concept has been deprecated because an alternative structure for tracking the evolution of a problem has been presented and adopted by the Care Provision Work Group.</td></tr><tr><td><a href=\"http://terminology.hl7.org/5.3.0/CodeSystem-v3-ActClass.html#v3-ActClass-DGIMG\">DGIMG</a></td><td style=\"color: #cccccc\">diagnostic image</td><td>Class for holding attributes unique to diagnostic images.</td></tr><tr><td><a href=\"http://terminology.hl7.org/5.3.0/CodeSystem-v3-ActClass.html#v3-ActClass-INVSTG\">INVSTG</a></td><td style=\"color: #cccccc\">investigation</td><td>An formalized inquiry into the circumstances surrounding a particular unplanned event or potential event for the purposes of identifying possible causes and contributing factors for the event. This investigation could be conducted at a local institutional level or at the level of a local or national government.</td></tr><tr><td><a href=\"http://terminology.hl7.org/5.3.0/CodeSystem-v3-ActClass.html#v3-ActClass-SPCOBS\">SPCOBS</a></td><td style=\"color: #cccccc\">specimen observation</td><td>An observation on a specimen in a laboratory environment that may affect processing, analysis or result interpretation</td></tr></table></li></ul></div>"
  },
  "url" : "http://hl7.org/cda/stds/core/ValueSet/CDAActClassObservation",
  "version" : "2.0.1-sd-202510-matchbox-patch",
  "name" : "CDAActClassObservation",
  "title" : "CDAActClassObservation",
  "status" : "draft",
  "experimental" : false,
  "date" : "2025-10-29T22:15:57+01:00",
  "publisher" : "Health Level 7",
  "contact" : [{
    "name" : "HL7 International - Structured Documents",
    "telecom" : [{
      "system" : "url",
      "value" : "http://www.hl7.org/Special/committees/structure"
    },
    {
      "system" : "email",
      "value" : "structdog@lists.HL7.org"
    }]
  }],
  "description" : "An act that is intended to result in new information about a subject. The main difference between Observations and other Acts is that Observations have a value attribute.",
  "compose" : {
    "include" : [{
      "system" : "http://terminology.hl7.org/CodeSystem/v3-ActClass",
      "concept" : [{
        "code" : "CASE"
      },
      {
        "code" : "OUTB"
      },
      {
        "code" : "COND"
      },
      {
        "code" : "OBSSER"
      },
      {
        "code" : "OBSCOR"
      },
      {
        "code" : "ROIBND"
      },
      {
        "code" : "ROIOVL"
      },
      {
        "code" : "OBS"
      },
      {
        "code" : "ALRT"
      },
      {
        "code" : "CLNTRL"
      },
      {
        "code" : "CNOD"
      },
      {
        "code" : "DGIMG"
      },
      {
        "code" : "INVSTG"
      },
      {
        "code" : "SPCOBS"
      }]
    }]
  }
}